In [1]:
import pandas as pd

In [3]:
data = {"name":["a","b","c","d","a","c"],"eng":[8,7,5,8,8,5],"hindi":[2,3,4,5,2,6]}

In [5]:
df = pd.DataFrame(data)
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      6

In [7]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [11]:
df["duplicate"] = df.duplicated()

In [13]:
df

  name  eng  hindi  duplicate
0    a    8      2      False
1    b    7      3      False
2    c    5      4      False
3    d    8      5      False
4    a    8      2       True
5    c    5      6      False

In [15]:
data = {"name":["a","b","c","d","a","c"],"eng":[8,7,5,8,8,5],"hindi":[2,3,4,5,2,6]}

In [17]:
df = pd.DataFrame(data)
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      6

In [19]:
df.drop_duplicates()

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6

In [21]:
df.drop_duplicates(inplace = True)

In [23]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6

In [25]:
dataset=pd.read_csv(r"C:\Users\ASUS\OneDrive\Desktop\pandas\loan.csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [29]:
dataset.duplicated().sum()

0

In [33]:
dataset.shape

(614, 13)

In [35]:
dataset.drop_duplicates(inplace=True)

In [41]:
dataset.shape
# it means there is no duplicates avlable in this dataset because both dataset.shape is same

(614, 13)